# ━━ Brew Options ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
cask_args appdir: '~/Applications', require_sha: true

# ━━ Brew Taps ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
tap 'jesseduffield/lazygit'
tap 'lintingzhen/tap'
tap 'hashicorp/tap'

# ━━ Brew Minimal ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
brew 'age'              # PGP alternative
brew 'atuin'            # Better shell history
brew 'bat'              # A better cat
brew 'fish'             # Fish shell
brew 'fisher'           # Fish plugin manager
brew 'fzf'              # Command-line fuzzy finder
brew 'go'               # Open source programming language
brew 'kubectl'          # Kubernetes command-line tool
brew 'kubectx'          # Tool to switch between kubectl contexts
brew 'neovim'           # Text editor
brew 'onefetch'         # Git repository summary in your terminal
brew 'starship'         # Cross-shell prompt that's fast, minimal and customizable
brew 'zoxide'           # Smarter cd command with learning capabilities

{{- if and .work .personal }}
tap 'postfinance/tap', 'https://gitlab.{{ .network.domain }}/developer-workplace/macos/homebrew-tap.git'

brew 'kubectl-login-cgo'
brew 'kubectl-mkconfig'
brew 'kubectl-vault_sync'
brew 'create-go-app'
{{- end -}}

# ━━ On personal workstations only ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
{{- if .personal }}
{{ include (joinPath .chezmoi.sourceDir "Brewfile.personal") }}
{{- end -}}

# ━━ Brew Darwin or Linux only ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
{{- if eq .chezmoi.os "darwin" }}
{{ include (joinPath .chezmoi.sourceDir "Brewfile.mac") }}
{{- else if eq .chezmoi.os "linux" }}
{{ include (joinPath .chezmoi.sourceDir "Brewfile.linux") }}
{{- end -}}
